Repository: common-repository/comment-blacklist-updater
Catalog: languages/comment-blacklist-updater-*.po
Languages: es_es

source: Blacklist Source
es_es: Fuente de la lista negra

source: Local Blacklist
es_es: Lista negra local

source: Excluded Terms
es_es: Términos excluidos

source: Data from the sources below will be loaded into the comment blacklist automatically.
es_es: Los datos de las fuentes siguientes se cargan automáticamente en la lista negra de comentarios.

source: Settings added by the <strong>Comment Blacklist Updater</strong> plugin
es_es: Ajustes añadidos por el plugin <strong>Comment Blacklist Updater</strong>

source: There is a local blacklist file at:
es_es: Existe una lista negra local en:

source: There is no local blacklist at:
es_es: No existe una lista negra local en:

source: If you want to include a <strong>local blacklist</strong> for the site, you can upload a blacklist.txt file to the UPLOADS folder and it will also be taken into account. The blacklist.txt file has to be in the root of the UPLOADS folder; it will not be recognized if it's for example in /uploads/2025/12/ and the file has to be accesible via http/https (if the access to the file is protected it can't be used).
es_es: Si queires incluir una lista negra <strong>local</strong> para el sitio web, puedes cargar un archivo blacklist. txt en la carpeta UPLOADS y también se tendrá en cuenta. El archivo blacklist. txt tiene que estar en la raíz de la carpeta UPLOADS; no se usará si por ejemplo está en /uploads/2025/12/, ademñas el archivo tiene que estar accesible a través de http/https (si el acceso al archivo está protegido no se puede utilizar).

source: Do you want to use the <strong>blacklist of <a href="http://www.splorp.com/" target="_blank">Grant Hutchinson</a></strong> which is maintained on <a href="https://github.com/splorp/wordpress-comment-blacklist/">Github</a> (check if you want to use it)?
es_es: ¿Quieres usar la <strong>lista negra de <a href="http://www.splorp.com/" target="_blank">Grant Hutchinson</a></strong> que se mantiene en <a href="https://github.com/splorp/wordpress-comment-blacklist/">Github</a> (marca la casilla si quieres usarla)?

source: Please keep in mind that if there is no other blacklist source defined, this will be used as default, even if it's not selected.
es_es: Por favor, ten en cuenta que si no hay ninguna otra lista negra configurada, esta se utilizará como predeterminada, incluso si no está seleccionada.

source: If you want to <strong>use another blacklist</strong>, please paste the URL here:
es_es: Si quieres <strong>utilizar otra lista negra</strong>, por favor pega la URL aquí:

source: The URL looks ok (please keep in mind that here we don't check if it exists, just if the URL looks ok).
es_es: La URL parece correcta (por favor ten en cuenta que aquí no comprobamos si existe, sólo si la URL parece correcta).

source: The URL doesn't seem to be valid. Please check the URL.
es_es: La URL no parece ser válida. Por favor, comprueba la URL.

source: The "rkv_cblm_replace_blacklist_sources" function exists so there is done some filtering on the blacklist sources. Please check your functions.php to see if the function adds another blacklist or replaces all of them
es_es: La función "rkv_cblm_replace_blacklist_sources" existe y entonces se está haciendo algún filtrado en las fuentes de las listas negras. Por favor, comprueba tu functions. php para ver si la función agrega otra lista negra o reemplaza todas ellas

source: We can't find the "rkv_cblm_replace_blacklist_sources" function on your WordPress installation.
es_es: No hemos encontrado la función "rkv_cblm_replace_blacklist_sources" en tu instalación de WordPress.

source: P.D. You can also use the <strong>filter "cblm_sources"</strong> to replace all the blacklists or to add more. If you replace all blacklists with the filter, the above settings will be ignored.
es_es: P.D. También puedes utilizar el <strong>filtro "cblm_sources"</strong> para sustituir todas las listas negras o agregar más. Si reemplazas todas las listas negras con el filtro, se ignorarán los ajustes anteriores.

source: These are the blacklist sources that are used to update the COMMENT BLACKLIST
es_es: Estas son las fuentes de la lista negra que se utilizan para actualizar la LISTA NEGRA DE COMENTARIOS

source: No blacklist sources have been defined.
es_es: No se han definido fuentes de lista negra.

source: Blacklist source updated today
es_es: Fuente de la lista negra actualizada hoy

source: Blacklist source updated on
es_es: Fuente de la lista negra actualizada el

source: View external source
es_es: Ver fuente externa

source: UNKNOWN
es_es: DESCONOCIDO

source: Blacklist updated on
es_es: Lista negra actualizada el

source: Automatic updates are performed every 24 hours
es_es: Las actualizaciones automáticas se realizan cada 24 horas

source: Next automatic update will be on
es_es: La próxima actualización automática se relizará

source: If you want you can run a manual update now
es_es: Si lo desea, puede ejecutar una actualización manual ahora

source: Run manual update
es_es: Ejecutar actualización manual

source: Any terms entered below will be added to the data retrieved from the blacklist sources but only when the update is done (either manually or automatically). If you add information here, save and the run a manual update. One word or IP per line. It will match inside words, so &#8220;press&#8221; will match &#8220;WordPress&#8221;.
es_es: Los terminos introducidos a continuación se añadirán a los datos recuperados de las fuentes de la lista negra, pero solo cuando se realice la actualización (ya sea de forma manual o automática). <strong>Si agregas información aquí, guarda primero y ejecuta luego una actualización manual</strong>. Pon solo una palabra o IP por línea. También afectará las palabras contenidas dentro de otras, como &#8220;press&#8221; que está dentro de &#8220;WordPress&#8221;.

source: Any terms entered below will be excluded from the blacklist updates but only when the update is done (either manually or automatically). <strong>If you add information here, save and the run a manual update</strong>. One word or IP per line. It will match inside words, so &#8220;press&#8221; will match &#8220;WordPress&#8221;.
es_es: Cualquier termino introducido a continuación se excluirá de las actualizaciones de la lista negra, pero solo cuando se realice la actualización (ya sea de forma manual o automática). <strong>Si agregas información aquí, guarda primero y ejecuta luego una actualización manual</strong>. Pon solo una palabra o IP por línea. También afectará las palabras contenidas dentro de otras, como &#8220;press&#8221; que está dentro de &#8220;WordPress&#8221;.

source: Blacklist terms were updated successfully.
es_es: Los términos de la lista negra se actualizaron correctamente.
